// ========================================================================================================================================== //
// НАЧАЛО ФАЙЛА (Employee.cs)
// ========================================================================================================================================== //


// =========[ ИНФОРМАЦИЯ О ФАЙЛЕ (НАЧАЛО) ]================================================================================================== //

// Тип работы  : Практическая работа (Практична робота)
// Тема работы : Классы в C# (Класи в C#)
// Студент     : Будюка Тимур (Timur Budyuka)
// Группа      : 1-3м (Комп'ютерні науки, ФІТ)

// ОПИСАНИЕ:
// Файл класса "Работник" (Employee).

// =========[ ИНФОРМАЦИЯ О ФАЙЛЕ (КОНЕЦ)  ]================================================================================================== //


// =========[ ПОДКЛЮЧАЕМЫЕ БИБЛИОТЕКИ, МОДУЛИ, КОМПОНЕНТЫ (НАЧАЛО) ]========================================================================= //
// using [подключаемая-библиотека-модуль-компонент];
// -----[ СИСТЕМНЫЕ/SYSTEM (НАЧАЛО) ]:
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
// -----[ СИСТЕМНЫЕ/SYSTEM (КОНЕЦ)  ].
// =========[ ПОДКЛЮЧАЕМЫЕ БИБЛИОТЕКИ, МОДУЛИ, КОМПОНЕНТЫ (КОНЕЦ)  ]========================================================================= //


// ПРОСТРАНСТВО ИМЕН [1]: "Лабораторная работа № 2. Классы в C#" (Lab2_Classes).
namespace Lab2_Classes
{


    #region// ==================[ КЛАССЫ (НАЧАЛО) ]================================

    // КЛАСС [1]: "Работник" (Employee).
    class Employee
    {

        // =========[ ПОЛЯ КЛАССА (НАЧАЛО) ]====================================
        // [модификатор-доступа] [тип] [имя-поля (параметра)];        

        public double salary = 0.0; // ПОЛЕ: "Зарплата"

        // =========[ ПОЛЯ КЛАССА (КОНЕЦ)  ]====================================


        #region// ==================[ КОНСТРУКТОРЫ (НАЧАЛО) ]==========================


        // КОНСТРУКТОР [1]: "Работник" (Employee). БЕЗ ПАРАМЕТРОВ.
        // =========[ ОПИСАНИЕ ]================================================
        // Создает объект Работник (User).
        // =====================================================================
        // =========[ ДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ ]===============================
        // Принцип    : [описание-принципа]
        // Пример     : [описание-примера]
        // Примечание : [описание-примечания]
        // Ограничения: [описание-ограничений]
        // Исключения : [описание-исключений]
        // Ошибки     : [описание-ошибок]
        // =====================================================================
        public Employee()
        {
            // ...
        } // Конец КОНСТРУКТОРА [1]: "Работник" (Employee). БЕЗ ПАРАМЕТРОВ.


        // КОНСТРУКТОР [2]: "Работник" (Employee).
        // =========[ ОПИСАНИЕ ]================================================
        // [описание] ...
        // =====================================================================
        // =========[ ДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ ]===============================
        // Принцип    : [описание-принципа]
        // Пример     : [описание-примера]
        // Примечание : [описание-примечания]
        // Ограничения: [описание-ограничений]
        // Исключения : [описание-исключений]
        // Ошибки     : [описание-ошибок]
        // =====================================================================
        // =========[ ФОРМАЛЬНЫЕ ПАРАМЕТРЫ ]====================================
        // 'param1' : [описание-параметра]
        // 'param2' : [описание-параметра]
        // =====================================================================
        public Employee(int param1, int param2) // <-- ref [тип] [параметр]
        {
            // ...
        } // Конец КОНСТРУКТОРА [2]: "Работник" (Employee).

        #endregion
        // ==================[ КОНСТРУКТОРЫ (КОНЕЦ)  ]==========================


        #region// ==================[ СВОЙСТВА (НАЧАЛО) ]==============================

        //// СВОЙСТВО [1]: "Зарплата" (Salary). АВТОСВОЙСТВО.
        //public double Salary { get; set; }
        //// Конец СВОЙСТВА [1]: "Зарплата" (Salary). АВТОСВОЙСТВО.


        // СВОЙСТВО [1]: "Сумма" (Sum). АВТОСВОЙСТВО.
        public double Sum { get; set; }
        // Конец СВОЙСТВА [1]: "Сумма" (Sum). АВТОСВОЙСТВО.


        //// СВОЙСТВО [2]: "Премия" (Premium). АВТОСВОЙСТВО.
        //public double Premium { get; set; }
        //// Конец СВОЙСТВА [2]: "Премия" (Premium). АВТОСВОЙСТВО.


        // СВОЙСТВО [?]: "Зарплата" (Salary).
        //public double Salary
        //{
        //    get // Для ЧТЕНИЯ значения.
        //    {
        //        return salary;
        //    } // Конец 'get'.
        //    set // Для ЗАПИСИ значения. 
        //    {
        //        salary = value;
        //    } // Конец 'set'.
        //} // Конец СВОЙСТВА [?]: "Зарплата" (Salary).


        //// СВОЙСТВО [2]: "Премия" (Premium).
        //public double Premium
        //{
        //    get // Для ЧТЕНИЯ значения.
        //    {
        //        return premium;
        //    } // Конец 'get'.
        //    set // Для ЗАПИСИ значения.
        //    {
        //        premium = value;
        //    } // Конец 'set'.
        //} // Конец СВОЙСТВА [2]: "Премия" (Premium).


        #endregion
        // ==================[ СВОЙСТВА (КОНЕЦ)  ]==============================


        #region// ==================[ ПЕРЕГРУЗКА ОПЕРАТОРОВ (НАЧАЛО) ]=================

        // ПЕРЕГРУЗКА ОПЕРАТОРА [1]: "+ (сложение)" (Addition).
        public static Employee operator +(Employee emp, double premium)
        {
            return new Employee { Sum = emp.salary + premium };
        } // Конец ПЕРЕГРУЗКИ ОПЕРАТОРА [1]: "+ (сложение)" (Addition).




        #endregion
        // ==================[ ПЕРЕГРУЗКА ОПЕРАТОРОВ (КОНЕЦ)  ]=================








    } // Конец КЛАССА [1]: "Работник" (Employee).


    #endregion
    // ==================[ КЛАССЫ (НАЧАЛО) ]================================



} // Конец ПРОСТРАНСТВА ИМЕН [1]: "Лабораторная работа № 2. Классы в C#" (Lab2_Classes).


// ========================================================================================================================================== //
// КОНЕЦ ФАЙЛА (Employee.cs)
// ========================================================================================================================================== //